xuos/xiuos/board/stm32f407-st-discovery/third_party_driver/uart/connect_usart.c
    USART_ITConfig(uart_device, USART_IT_IDLE , ENABLE);

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);

    DmaUartConfig(dma, uart_device, serial_cfg->data_cfg.serial_buffer_size, serial_dev->serial_fifo.serial_rx->serial_rx_buffer);

    DMA_ClearFlag(dma->RxStream, dma->RxFlag);
    DMA_ITConfig(dma->RxStream, DMA_IT_TC, ENABLE);
    USART_DMACmd(uart_device, USART_DMAReq_Rx, ENABLE);
    DMA_Cmd(dma->RxStream, ENABLE);

    NVIC_InitStructure.NVIC_IRQChannel = dma->RxIrqCh;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

static void SerialCfgParamCheck(struct SerialCfgParam *serial_cfg_default, struct SerialCfgParam *serial_cfg_new)
{
    struct SerialDataCfg *data_cfg_default = &serial_cfg_default->data_cfg;
    struct SerialDataCfg *data_cfg_new = &serial_cfg_new->data_cfg;

    if((data_cfg_default->serial_baud_rate != data_cfg_new->serial_baud_rate) && (data_cfg_new->serial_baud_rate)){
        data_cfg_default->serial_baud_rate = data_cfg_new->serial_baud_rate;
    }

    if((data_cfg_default->serial_bit_order != data_cfg_new->serial_bit_order) && (data_cfg_new->serial_bit_order)) {
        data_cfg_default->serial_bit_order = data_cfg_new->serial_bit_order;
    }

    if((data_cfg_default->serial_buffer_size != data_cfg_new->serial_buffer_size) && (data_cfg_new->serial_buffer_size)){
        data_cfg_default->serial_buffer_size = data_cfg_new->serial_buffer_size;
    }

    if((data_cfg_default->serial_data_bits != data_cfg_new->serial_data_bits) && (data_cfg_new->serial_data_bits)) {
        data_cfg_default->serial_data_bits = data_cfg_new->serial_data_bits;
    }

    if((data_cfg_default->serial_invert_mode != data_cfg_new->serial_invert_mode) && (data_cfg_new->serial_invert_mode)) {
        data_cfg_default->serial_invert_mode = data_cfg_new->serial_invert_mode;
    }

    if((data_cfg_default->serial_parity_mode != data_cfg_new->serial_parity_mode) && (data_cfg_new->serial_parity_mode)){
        data_cfg_default->serial_parity_mode = data_cfg_new->serial_parity_mode;
    }

    if((data_cfg_default->serial_stop_bits != data_cfg_new->serial_stop_bits) && (data_cfg_new->serial_stop_bits)) {
        data_cfg_default->serial_stop_bits = data_cfg_new->serial_stop_bits;
    }
}

static uint32 Stm32SerialInit(struct SerialDriver *serial_drv, struct BusConfigureInfo *configure_info)
{
    NULL_PARAM_CHECK(serial_drv);

    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    if(configure_info->private_data){
        struct SerialCfgParam *serial_cfg_new = (struct SerialCfgParam *)configure_info->private_data;
        SerialCfgParamCheck(serial_cfg, serial_cfg_new);
    }

    USART_InitTypeDef USART_InitStructure;

    USART_InitStructure.USART_BaudRate = serial_cfg->data_cfg.serial_baud_rate;

    if (serial_cfg->data_cfg.serial_data_bits == DATA_BITS_8) {
        USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    }
    else if (serial_cfg->data_cfg.serial_data_bits == DATA_BITS_9) {
        USART_InitStructure.USART_WordLength = USART_WordLength_9b;
    }

    if (serial_cfg->data_cfg.serial_stop_bits == STOP_BITS_1){
        USART_InitStructure.USART_StopBits = USART_StopBits_1;
    }
    else if (serial_cfg->data_cfg.serial_stop_bits == STOP_BITS_2){
        USART_InitStructure.USART_StopBits = USART_StopBits_2;
    }

    if (serial_cfg->data_cfg.serial_parity_mode == PARITY_NONE){
        USART_InitStructure.USART_Parity = USART_Parity_No;
    }
    else if (serial_cfg->data_cfg.serial_parity_mode == PARITY_ODD){
        USART_InitStructure.USART_Parity = USART_Parity_Odd;
    }
    else if (serial_cfg->data_cfg.serial_parity_mode == PARITY_EVEN){
        USART_InitStructure.USART_Parity = USART_Parity_Even;
    }

    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(serial_hw_cfg->uart_device, &USART_InitStructure);

    USART_Cmd(serial_hw_cfg->uart_device, ENABLE);

    return EOK;
}

static uint32 Stm32SerialConfigure(struct SerialDriver *serial_drv, int serial_operation_cmd)
{
    NULL_PARAM_CHECK(serial_drv);

    struct SerialHardwareDevice *serial_dev = (struct SerialHardwareDevice *)serial_drv->driver.owner_bus->owner_haldev;
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;
    struct SerialDevParam *serial_dev_param = (struct SerialDevParam *)serial_dev->haldev.private_data;

    switch (serial_operation_cmd)
    {
        case OPER_CLR_INT:
            UART_DISABLE_IRQ(serial_hw_cfg->irq);
            USART_ITConfig(serial_hw_cfg->uart_device, USART_IT_RXNE, DISABLE);
            break;
        case OPER_SET_INT:
            UART_ENABLE_IRQ(serial_hw_cfg->irq);
            USART_ITConfig(serial_hw_cfg->uart_device, USART_IT_RXNE, ENABLE);
            break;
        case OPER_CONFIG :
            if (SIGN_OPER_DMA_RX == serial_dev_param->serial_set_mode){
                DMAConfiguration(serial_dev, serial_hw_cfg->uart_device);
            }
    }

    return EOK;
}

static int Stm32SerialPutchar(struct SerialHardwareDevice *serial_dev, char c)
{
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_dev->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    while (!(serial_hw_cfg->uart_device->SR & USART_FLAG_TXE));
    serial_hw_cfg->uart_device->DR = c;

    return EOK;
}

static int Stm32SerialGetchar(struct SerialHardwareDevice *serial_dev)
{
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_dev->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    int ch = -1;
    if (serial_hw_cfg->uart_device->SR & USART_FLAG_RXNE)      {
        ch = serial_hw_cfg->uart_device->DR & 0xff;
    }

