xuos/xiuos/board/stm32f407-st-discovery/third_party_driver/uart/connect_usart.c
    return ch;
}

static void DmaUartRxIdleIsr(struct SerialHardwareDevice *serial_dev, struct Stm32UsartDma *dma, USART_TypeDef *uart_device)
{
    x_base level = CriticalAreaLock();

    x_size_t recv_total_index = dma->SettingRecvLen - DMA_GetCurrDataCounter(dma->RxStream);
    x_size_t recv_len = recv_total_index - dma->LastRecvIndex;
    dma->LastRecvIndex = recv_total_index;
    CriticalAreaUnLock(level);

    if (recv_len) SerialSetIsr(serial_dev, SERIAL_EVENT_RX_DMADONE | (recv_len << 8));

    USART_ReceiveData(uart_device);
}

static void DmaRxDoneIsr(struct Stm32Usart *serial, struct SerialDriver *serial_drv, struct SerialHardwareDevice *serial_dev)
{
    struct Stm32UsartDma *dma = &serial->dma; 
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    if (DMA_GetFlagStatus(dma->RxStream, dma->RxFlag) != RESET)
    {
        x_base level = CriticalAreaLock();

        x_size_t recv_len = dma->SettingRecvLen - dma->LastRecvIndex;
        dma->LastRecvIndex = 0;
        CriticalAreaUnLock(level);

        if (recv_len) SerialSetIsr(serial_dev, SERIAL_EVENT_RX_DMADONE | (recv_len << 8));

        DMA_ClearFlag(dma->RxStream, dma->RxFlag);
    }
}

static void UartIsr(struct Stm32Usart *serial, struct SerialDriver *serial_drv, struct SerialHardwareDevice *serial_dev)
{
    struct Stm32UsartDma *dma = &serial->dma; 
    struct SerialCfgParam *serial_cfg = (struct SerialCfgParam *)serial_drv->private_data;
    struct UsartHwCfg *serial_hw_cfg = (struct UsartHwCfg *)serial_cfg->hw_cfg.private_data;

    if(USART_GetITStatus(serial_hw_cfg->uart_device, USART_IT_RXNE) != RESET){
        SerialSetIsr(serial_dev, SERIAL_EVENT_RX_IND);
        USART_ClearITPendingBit(serial_hw_cfg->uart_device, USART_IT_RXNE);
    }
    if(USART_GetITStatus(serial_hw_cfg->uart_device, USART_IT_IDLE) != RESET){
        DmaUartRxIdleIsr(serial_dev, dma, serial_hw_cfg->uart_device);
    }
    if (USART_GetITStatus(serial_hw_cfg->uart_device, USART_IT_TC) != RESET){
        USART_ClearITPendingBit(serial_hw_cfg->uart_device, USART_IT_TC);
    }
    if (USART_GetFlagStatus(serial_hw_cfg->uart_device, USART_FLAG_ORE) == SET){
        USART_ReceiveData(serial_hw_cfg->uart_device);
    }
}

#ifdef BSP_USING_USART1
struct Stm32Usart serial_1;
struct SerialDriver serial_driver_1;
struct SerialHardwareDevice serial_device_1;

static const struct Stm32UsartDma usart_dma_1 =
{
    DMA2_Stream5,
    DMA_Channel_4,
    DMA_FLAG_TCIF5,
    DMA2_Stream5_IRQn,
    0,
    0,
};

void USART1_IRQHandler(int irq_num, void *arg)
{
    UartIsr(&serial_1, &serial_driver_1, &serial_device_1);
}
DECLARE_HW_IRQ(USART1_IRQn, USART1_IRQHandler, NONE);

void DMA2_Stream5_IRQHandler(int irq_num, void *arg) {
    DmaRxDoneIsr(&serial_1, &serial_driver_1, &serial_device_1);
}
DECLARE_HW_IRQ(DMA2_Stream5_IRQn, DMA2_Stream5_IRQHandler, NONE);
#endif

#ifdef BSP_USING_USART2
struct Stm32Usart serial_2;
struct SerialDriver serial_driver_2;
struct SerialHardwareDevice serial_device_2;

static const struct Stm32UsartDma usart_dma_2 =
{
    DMA1_Stream5,
    DMA_Channel_4,
    DMA_FLAG_TCIF5,
    DMA1_Stream5_IRQn,
    0,
    0,
};

void USART2_IRQHandler(int irq_num, void *arg)
{
    UartIsr(&serial_2, &serial_driver_2, &serial_device_2);
}
DECLARE_HW_IRQ(USART2_IRQn, USART2_IRQHandler, NONE);

void DMA1_Stream5_IRQHandler(int irq_num, void *arg) {
    DmaRxDoneIsr(&serial_2, &serial_driver_2, &serial_device_2);
}
DECLARE_HW_IRQ(DMA1_Stream5_IRQn, DMA1_Stream5_IRQHandler, NONE);
#endif

#ifdef BSP_USING_USART3
struct Stm32Usart serial_3;
struct SerialDriver serial_driver_3;
struct SerialHardwareDevice serial_device_3;

static const struct Stm32UsartDma usart_dma_3 =
{
    DMA1_Stream1,
    DMA_Channel_4,
    DMA_FLAG_TCIF1,
    DMA1_Stream1_IRQn,
    0,
    0,
};

void USART3_IRQHandler(int irq_num, void *arg)
{
    UartIsr(&serial_3, &serial_driver_3, &serial_device_3);
}
DECLARE_HW_IRQ(USART3_IRQn, USART3_IRQHandler, NONE);

void DMA1_Stream1_IRQHandler(int irq_num, void *arg) {
    DmaRxDoneIsr(&serial_3, &serial_driver_3, &serial_device_3);
}
DECLARE_HW_IRQ(DMA1_Stream1_IRQn, DMA1_Stream1_IRQHandler, NONE);
#endif

#ifdef BSP_USING_UART4
struct Stm32Usart serial_4;
struct SerialDriver serial_driver_4;
struct SerialHardwareDevice serial_device_4;

static const struct Stm32UsartDma uart_dma_4 =
{
    DMA1_Stream2,
    DMA_Channel_4,
    DMA_FLAG_TCIF2,
    DMA1_Stream2_IRQn,
    0,
    0,
};

void UART4_IRQHandler(int irq_num, void *arg)
{
    UartIsr(&serial_4, &serial_driver_4, &serial_device_4);
}
DECLARE_HW_IRQ(UART4_IRQn, UART4_IRQHandler, NONE);

void DMA1_Stream2_IRQHandler(int irq_num, void *arg) {
    DmaRxDoneIsr(&serial_4, &serial_driver_4, &serial_device_4);
}
DECLARE_HW_IRQ(DMA1_Stream2_IRQn, DMA1_Stream2_IRQHandler, NONE);
#endif

#ifdef BSP_USING_UART5
struct Stm32Usart serial_5;
struct SerialDriver serial_driver_5;
struct SerialHardwareDevice serial_device_5;

static const struct Stm32UsartDma uart_dma_5 =
{
    DMA1_Stream0,
    DMA_Channel_4,
    DMA_FLAG_TCIF0,
    DMA1_Stream0_IRQn,
    0,
    0,
};

void UART5_IRQHandler(int irq_num, void *arg)
{
    UartIsr(&serial_5, &serial_driver_5, &serial_device_5);
}
DECLARE_HW_IRQ(UART5_IRQn, UART5_IRQHandler, NONE);

void DMA1_Stream0_IRQHandler(int irq_num, void *arg) {
    DmaRxDoneIsr(&serial_5, &serial_driver_5, &serial_device_5);
}
DECLARE_HW_IRQ(DMA1_Stream0_IRQn, DMA1_Stream0_IRQHandler, NONE);
#endif

static uint32 Stm32SerialDrvConfigure(void *drv, struct BusConfigureInfo *configure_info)
{
    NULL_PARAM_CHECK(drv);
    NULL_PARAM_CHECK(configure_info);

    x_err_t ret = EOK;
    int serial_operation_cmd;
    struct SerialDriver *serial_drv = (struct SerialDriver *)drv;

    switch (configure_info->configure_cmd)
    {
    case OPE_INT:
        ret = Stm32SerialInit(serial_drv, configure_info);
        break;
    case OPE_CFG:
        serial_operation_cmd = *(int *)configure_info->private_data;
        ret = Stm32SerialConfigure(serial_drv, serial_operation_cmd);
        break;
    default:
        break;
    }

    return ret;
}

static const struct SerialDataCfg data_cfg_init = 
{
    .serial_baud_rate = BAUD_RATE_115200,
    .serial_data_bits = DATA_BITS_8,
    .serial_stop_bits = STOP_BITS_1,
    .serial_parity_mode = PARITY_NONE,
    .serial_bit_order = BIT_ORDER_LSB,
    .serial_invert_mode = NRZ_NORMAL,
    .serial_buffer_size = SERIAL_RB_BUFSZ,
};

