xuos/xiuos/board/stm32f407-st-discovery/third_party_driver/uart/connect_usart.c
    static struct UsartHwCfg serial_hw_cfg_4;
    memset(&serial_hw_cfg_4, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_4;
    memset(&serial_dev_param_4, 0, sizeof(struct SerialDevParam));

    serial_4.dma = uart_dma_4;
    
    serial_driver_4.drv_done = &drv_done;
    serial_driver_4.configure = &Stm32SerialDrvConfigure;
    serial_device_4.hwdev_done = &hwdev_done;

    serial_cfg_4.data_cfg = data_cfg_init;

    serial_hw_cfg_4.uart_device = UART4;
    serial_hw_cfg_4.irq = UART4_IRQn;
    serial_cfg_4.hw_cfg.private_data = (void *)&serial_hw_cfg_4;
    serial_driver_4.private_data = (void *)&serial_cfg_4;

    serial_dev_param_4.serial_work_mode = SIGN_OPER_INT_RX;
    serial_device_4.haldev.private_data = (void *)&serial_dev_param_4;

    NVIC_Configuration(serial_hw_cfg_4.irq);

    ret = BoardSerialBusInit(&serial_4.SerialBus, &serial_driver_4, SERIAL_BUS_NAME_4, SERIAL_DRV_NAME_4);
    if(EOK != ret){
        KPrintf("Stm32HwUsartInit usart4 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_4, (void *)&serial_cfg_4, SERIAL_BUS_NAME_4, SERIAL_4_DEVICE_NAME_0);
    if(EOK != ret) {
        KPrintf("Stm32HwUsartInit usart4 error ret %u\n", ret);
        return ERROR;
    }    
#endif

#ifdef BSP_USING_UART5
    static struct SerialCfgParam serial_cfg_5;
    memset(&serial_cfg_5, 0, sizeof(struct SerialCfgParam));

    static struct UsartHwCfg serial_hw_cfg_5;
    memset(&serial_hw_cfg_5, 0, sizeof(struct UsartHwCfg));

    static struct SerialDevParam serial_dev_param_5;
    memset(&serial_dev_param_5, 0, sizeof(struct SerialDevParam));

    serial_5.dma = uart_dma_5;
    
    serial_driver_5.drv_done = &drv_done;
    serial_driver_5.configure = &Stm32SerialDrvConfigure;
    serial_device_5.hwdev_done = &hwdev_done;

    serial_cfg_5.data_cfg = data_cfg_init;

    serial_hw_cfg_5.uart_device = UART5;
    serial_hw_cfg_5.irq = UART5_IRQn;
    serial_cfg_5.hw_cfg.private_data = (void *)&serial_hw_cfg_5;
    serial_driver_5.private_data = (void *)&serial_cfg_5;

    serial_dev_param_5.serial_work_mode = SIGN_OPER_INT_RX;
    serial_device_5.haldev.private_data = (void *)&serial_dev_param_5;

    NVIC_Configuration(serial_hw_cfg_5.irq);

    ret = BoardSerialBusInit(&serial_5.SerialBus, &serial_driver_5, SERIAL_BUS_NAME_5, SERIAL_DRV_NAME_5);
    if(EOK != ret){
        KPrintf("Stm32HwUsartInit usart5 error ret %u\n", ret);
        return ERROR;
    }

    ret = BoardSerialDevBend(&serial_device_5, (void *)&serial_cfg_5, SERIAL_BUS_NAME_5, SERIAL_5_DEVICE_NAME_0);
    if(EOK != ret){
        KPrintf("Stm32HwUsartInit usart5 error ret %u\n", ret);
        return ERROR;
    }    
#endif

    return ret;
}
